app/Http/Controllers/Api/HomePageController.php

select * from `notif_users` where `notif_users`.`laporan_id` in (2)
---
    public function notifUserPatch($id)
    {
        $userInit = auth()->user();
        $laporanInit = Laporan::where('id', $id)->first();

        $notifLaporan = NotifUser::where('laporan_id', $laporanInit->id)->update([
            'is_read' => true,
        ]);