app/Http/Controllers/Api/HomePageController.php

select * from `laporans` where `laporans`.`id` in (1)
select * from `notif_users` where `user_id` = 2 and `is_read` = 0
---
    public function notifUser()
    {
        $userInit = auth()->user();

        $initNotif = NotifUser::with('laporan')->where('user_id', $userInit->id)->where('is_read', false)->get();