app/Http/Controllers/Api/HomePageController.php

    public function laporanTerdekat($late, $longe)
    {
        $lat = floatval($late);
        $long = floatval($longe);

        $radius = 6371;

        $laporanTerdekatInit = Laporan::selectRaw(
            "*,
        ($radius * acos(cos(radians(?)) * cos(radians(`lat`)) * cos(radians(`long`) - radians(?)) + sin(radians(?)) * sin(radians(`lat`)))) AS distance",
            [$lat, $long, $lat]
        )
            ->having("distance", "<", 5)
            ->orderBy("distance", "asc")
            ->with('BuktiLaporan', 'ReportLaporan', 'NotifUser', 'VoteLaporan')
            ->where('status_laporan', 'perlu-dukungan')
            ->limit(4)
            ->get();

        $mappedData = $laporanTerdekatInit->map(function ($item) {

            // init lat long laporan
            $latitude = (float) str_replace(',', '.', $item->lat);
            $longitude = (float) str_replace(',', '.', $item->long);

            // init alamat
            $alamat = $this->convertAlamat->getAddressFromCoordinates($latitude, $longitude);

            return [
                'id' => $item->id,
                'judul_laporan' => $item->judul_laporan,
                'deskripsi_laporan' => $item->deskripsi_laporan,
                'alamat_laporan' => $alamat,
                'status_laporan' => $item->status_laporan,
                'bukti_laporan' => $item->BuktiLaporan ? $item->BuktiLaporan[0]->bukti_laporan : null,
            ];
        });
---
select * from `bukti_laporans` where `bukti_laporans`.`laporan_id` in (1, 2, 3)
select * from `notif_users` where `notif_users`.`laporan_id` in (1, 2, 3)
select * from `report_laporans` where `report_laporans`.`laporan_id` in (1, 2, 3)
select *,
(6371 * acos(cos(radians(-7.2826509)) * cos(radians(`lat`)) * cos(radians(`long`) - radians(112.7843071)) + sin(radians(-7.2826509)) * sin(radians(`lat`)))) AS distance from `laporans` where `status_laporan` = 'perlu-dukungan' having `distance` < 5 order by `distance` asc limit 4
select * from `bukti_laporans` where `bukti_laporans`.`laporan_id` = 1 and `bukti_laporans`.`laporan_id` is not null

    public function notifUser()
    {
        $userInit = auth()->user();

        $initNotif = NotifUser::with('laporan')->where('user_id', $userInit->id)->where('is_read', false)->get();

        $countNotif = $initNotif->count();

        $initNotifAll = NotifUser::with('laporan')->where('user_id', $userInit->id)->get();
---
select * from `notif_users` where `user_id` = 2 and `is_read` = 0
select * from `laporans` where `laporans`.`id` in (1)
select * from `notif_users` where `user_id` = 2

                ]
            ]);
        } else {
            $mappedData = $initNotifAll->map(function ($item) {
                return [
                    'id' => $item->id,
                    'laporan_id' => $item->laporan_id,
                    'judul_laporan' => $item->laporan ? $item->laporan->judul_laporan : null,
                    'deskripsi_laporan' => $item->laporan ? $item->laporan->deskripsi_laporan : null,
                    'status_laporan' => $item->status_laporan,
                    'tanggal_notif' => $item->created_at->format('Y-m-d H:i:s'),
                    'is_selected' => $item->is_read ? false : true
                ];
            });
---
select * from `vote_laporans` where `vote_laporans`.`laporan_id` in (2)