app/Http/Controllers/Api/LaporanController.php

select * from `bukti_laporans` where `bukti_laporans`.`laporan_id` in (2)
---
    public function getLaporan($id)
    {
        $laporan = $this->laporan->where('id', $id)->first();

        if (!$laporan) {
            return response()->json([
                'success' => false,
                'message' => 'Laporan tidak ditemukan'
            ], 404);
        }

        $is_laporan_sendiri = $laporan->user_id == auth()->user()->id;
        $buktiLaporan = $laporan->BuktiLaporan->map(function ($bukti) {
            // $is_video = strpos($bukti->bukti_laporan, '.mp4') ? true : false;
            $videoExtensions = ['mp4', 'avi', 'mkv', 'mov', 'wmv', 'flv', 'webm', 'mpeg', 'mpg', '3gp', 'ogg'];
            $fileExtension = strtolower(pathinfo($bukti->bukti_laporan, PATHINFO_EXTENSION));
            $is_video = in_array($fileExtension, $videoExtensions);

            return [
                'bukti_laporan' => $bukti->bukti_laporan,
                'is_video' => $is_video
            ];
        });

select * from `vote_laporans` where `vote_laporans`.`laporan_id` in (1)
---
    public function updateCommentLaporan($id)
    {

        $initLog = auth()->user()->id;

        $comment = CommentLaporan::where('id', $id)->first();

        if (!$comment) {
            return response()->json([
                'success' => false,
                'message' => 'Komentar tidak ditemukan'
            ], 404);
        }

        if ($comment->user_id != $initLog) {
            return response()->json([
                'success' => false,
                'message' => 'Anda tidak bisa mengubah komentar orang lain'
            ], 400);
        }

        $validator = Validator::make(request()->all(), [
            'comment_laporan' => 'required|string',
        ]);