app/Http/Controllers/Api/LaporanController.php

select * from `bukti_laporans` where `bukti_laporans`.`laporan_id` in (1)
select * from `comment_laporans` where `comment_laporans`.`laporan_id` in (1)
select * from `notif_users` where `notif_users`.`laporan_id` in (1)
select * from `report_laporans` where `report_laporans`.`laporan_id` in (1)
---
    public function __construct(ConvertAlamatService $convertAlamat)
    {
        $this->convertAlamat = $convertAlamat;
        $this->laporan = Laporan::with('BuktiLaporan', 'ReportLaporan', 'NotifUser', 'VoteLaporan', 'CommentLaporan');

select * from `vote_laporans` where `vote_laporans`.`laporan_id` in (2)
select * from `report_laporans` where `laporan_id` = '2' and `user_id` = 2 limit 1
---
    public function laporanReport($id, Request $request)
    {
        $validator = Validator::make($request->all(), [
            'pesan_report' => 'required|string',
        ]);

        if ($validator->fails()) {
            return response()->json($validator->errors(), 400);
        }


        try {
            $initLog = auth()->user()->id;
            $laporan = $this->laporan->where('id', $id)->first();

            if (!$laporan) {
                return response()->json([
                    'success' => false,
                    'message' => 'Laporan tidak ditemukan'
                ], 404);
            }

            $reportLaporan = ReportLaporan::where('laporan_id', $id)->where('user_id', $initLog)->first();

insert into `report_laporans` (`laporan_id`, `user_id`, `pesan_report`, `updated_at`, `created_at`) values ('2', 2, 'ini penipuan dick', '2024-06-16 14:57:55', '2024-06-16 14:57:55')
---
                ], 400);
            }

            $successInsert = ReportLaporan::create([
                'laporan_id' => $id,
                'user_id' => $initLog,
                'pesan_report' => $request->pesan_report,
            ]);

select * from `vote_laporans` where `vote_laporans`.`laporan_id` in (2)
select * from `bukti_comments` where `bukti_comments`.`comment_laporan_id` = 1 and `bukti_comments`.`comment_laporan_id` is not null
select * from `users` where `users`.`id` = 4 limit 1
---
    public function getLaporan($id)
    {
        $laporan = $this->laporan->where('id', $id)->first();

        if (!$laporan) {
            return response()->json([
                'success' => false,
                'message' => 'Laporan tidak ditemukan'
            ], 404);
        }

        $is_laporan_sendiri = $laporan->user_id == auth()->user()->id;

        $latitude = (float) str_replace(',', '.', $laporan->lat);
        $longitude = (float) str_replace(',', '.', $laporan->long);

        $alamat = $this->convertAlamat->getAddressFromCoordinates($latitude, $longitude);

        $buktiLaporan = $laporan->BuktiLaporan->map(function ($bukti) {
            return [
                'bukti_laporan' => $bukti->bukti_laporan,
            ];
        });

        $comments = $laporan->CommentLaporan->map(function ($comment) {

            $is_komentar_kapolsek = $comment->user_id == 1;

            return [
                'id' => $comment->id,
                'user_id' => $comment->user_id,
                'nama' => $comment->user->nama,
                'foto_profil' => $comment->user ? $comment->user->profile_photo_path : null,
                'comment' => $comment->comment_laporan,
                'tanggal_comment' => $comment->created_at->format('d M Y H:i:s'),
                'is_comment_dia_sendiri' => $comment->user_id == auth()->user()->id,
                'is_editted_comment' => $comment->updated_at != $comment->created_at,
                'kapolsek_bukti' => $comment->BuktiComment->isEmpty() ? null : $comment->BuktiComment->map(function ($bukti_kapolsek) {
                    return [
                        'bukti_kapolsek' => $bukti_kapolsek->bukti_comment,
                    ];
                }),
                'is_komentar_kapolsek' => $is_komentar_kapolsek
            ];

select * from `vote_laporans` where `vote_laporans`.`laporan_id` in (2)
select * from `bukti_laporans` where `bukti_laporans`.`laporan_id` in (2)
select * from `notif_users` where `notif_users`.`laporan_id` in (2)
select * from `report_laporans` where `report_laporans`.`laporan_id` in (2)
select *,
(6371 * acos(cos(radians('-7.2826509')) * cos(radians(`lat`)) * cos(radians(`long`) - radians('112.7843071')) + sin(radians('-7.2826509')) * sin(radians(`lat`)))) AS distance from `laporans` where `status_laporan` = 'perlu-dukungan' having `distance` < 5 order by `distance` asc limit 1
---
    public function beriDukungan($id, $lat, $long)
    {
        $initLog = auth()->user()->id;

        $laporan = $this->laporan->where('id', $id)->first();

        if (!$laporan) {
            return response()->json([
                'success' => false,
                'message' => 'Laporan tidak ditemukan'
            ], 404);
        }

        // pengecekan lat long user, jika jarak 5kilo jauh dari lat long laporan, maka tidak bisa memberi dukungan
        $radius = 6371;

        $laporanTerdekatInit = Laporan::selectRaw(
            "*,
        ($radius * acos(cos(radians(?)) * cos(radians(`lat`)) * cos(radians(`long`) - radians(?)) + sin(radians(?)) * sin(radians(`lat`)))) AS distance",
            [$lat, $long, $lat]
        )
            ->having("distance", "<", 5)
            ->orderBy("distance", "asc")
            ->with('BuktiLaporan', 'ReportLaporan', 'NotifUser', 'VoteLaporan')
            ->where('status_laporan', 'perlu-dukungan')
            ->first();

insert into `vote_laporans` (`user_id`, `laporan_id`, `updated_at`, `created_at`) values (2, 2, '2024-06-16 21:21:30', '2024-06-16 21:21:30')
---
            ]);
        }

        $successInsert = $laporan->VoteLaporan()->create([
            'user_id' => $initLog,
        ]);

select * from `comment_laporans` where `id` = '6' limit 1
---
    public function deleteCommentLaporan($id)
    {
        $initLog = auth()->user()->id;

        $comment = CommentLaporan::where('id', $id)->first();

select * from `bukti_laporans` where `bukti_laporans`.`laporan_id` in (1, 2, 3)
select * from `vote_laporans` where `vote_laporans`.`laporan_id` in (1, 2, 3)
---
    public function laporanAnda($status_laporan)
    {
        $initLog = auth()->user()->id;

        if ($status_laporan == 'semua-data') {
            $laporanAnda = $this->laporan->where('user_id', $initLog)->get();
        } else {
            $laporanAnda = $this->laporan->where('user_id', $initLog)->where('status_laporan', $status_laporan)->get();
        }

        if ($laporanAnda->isEmpty()) {
            return response()->json([
                'success' => false,
                'message' => 'Tidak ada laporan'
            ], 404);
        }

        $mappedData = $laporanAnda->map(function ($item) {

            // init lat long laporan
            $latitude = (float) str_replace(',', '.', $item->lat);
            $longitude = (float) str_replace(',', '.', $item->long);

            // init alamat
            $alamat = $this->convertAlamat->getAddressFromCoordinates($latitude, $longitude);

            return [
                'id' => $item->id,
                'judul_laporan' => $item->judul_laporan,
                'deskripsi_laporan' => $item->deskripsi_laporan,
                'alamat_laporan' => $alamat,
                'status_laporan' => $item->status_laporan,
                'bukti_laporan' => $item->BuktiLaporan ? $item->BuktiLaporan[0]->bukti_laporan : null,
            ];
        });

insert into `laporans` (`user_id`, `judul_laporan`, `deskripsi_laporan`, `alamat`, `lat`, `long`, `updated_at`, `created_at`) values (2, 'Contoh Judul Laporan', 'Deskripsi laporan untuk pengujian.', 'Jl. Contoh No. 123', -7.2826508, 112.7843072, '2024-06-16 22:32:20', '2024-06-16 22:32:20')
---
                ], 400);
            }

            $laporan = Laporan::create([
                'user_id' => $initLog,
                'judul_laporan' => $request->judul_laporan,
                'deskripsi_laporan' => $request->deskripsi_laporan,
                'alamat' => $request->alamat,
                'lat' => $request->lat,
                'long' => $request->long,
            ]);