app/Http/Controllers/Api/Auth/ServiceTwilloController.php

select * from `users` where `email` = 'ari@gmail.com' limit 1
---
    public function login(Request $request)
    {
        $validator = Validator::make($request->all(), [
            'email' => 'required|string|email',
            'password' => 'required|string',
        ]);

        if ($validator->fails()) {
            return response()->json($validator->errors(), 400);
        }

        if (!$token = Auth::guard('api')->attempt($validator->validated())) {
            return response()->json([
                'success' => false,
                'message' => 'Unauthorized',
            ], 401);
        }

        try {
            $userValid = User::where('email', $request->email)->first();