app/Http/Controllers/DashboardController.php

select count(*) as aggregate from `laporans`
select count(*) as aggregate from `laporans` where `status_laporan` = 'perlu-teratasi'
---
    public function index()
    {
        $semuaLaporan = Laporan::count();
        $sudahDiatasi = Laporan::where('status_laporan', 'sudah-teratasi')->count();