app/Http/Controllers/LaporanController.php

select * from `bukti_laporans` where `bukti_laporans`.`laporan_id` in (1, 2)
select * from `report_laporans` where `report_laporans`.`laporan_id` in (1, 2)
select * from `vote_laporans` where `vote_laporans`.`laporan_id` in (1, 2)
---
    public function index()
    {
        $laporans = Laporan::with('BuktiLaporan', 'ReportLaporan', 'VoteLaporan')->get();