app/Http/Controllers/PemantauanController.php

select * from `laporans`
---
    public function index()
    {
        $semuaDataLaporan = Laporan::all();